Repository: Gustavo1011/pcentryx_backend
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: es

source: The document is already renewed
es: El documento ya está renovado

source: The issue date field must be before or equal to the current date
es: La fecha de emisión debe ser anterior o igual a la fecha actual del sistema

source: The commercialization option must be enabled
es: La opción comercialización debe estar habilitada

source: Tax must be greater than 0
es: El impuesto debe ser mayor que 0

source: Tax must be 0
es: El impuesto debe ser 0

source: The product type must be Equipment
es: El tipo de producto debe ser Equipo

source: The file was not found
es: No se ha encontrado el archivo

source: The document should at least have a category enabled
es: El documento debe tener al menos a una categoría habilitada

source: Tax must be less than or equal to the tax of the country
es: El valor de IVA no puede ser mayor al establecido por país

source: The document does not belong to the country sent
es: El documento no pertenece al país enviado

source: The agent type was not found
es: El tipo de agente no fue encontrado

source: The agent doesn't have history
es: El agente no tiene historial

source: The agent has been disabled
es: El agente ha sido deshabilitado

source: The agent has been enabled
es: El agente ha sido habilitado

source: To a consolidator
es: Hacia un consolidador

source: To an intermediary
es: Hacia un intermediario

source: To a logistic
es: Hacia un logístico

source: To a courier
es: Hacia un courier

source: To a company
es: Hacia una compañía

source: To a transport
es: Hacia un transporte

source: To a warehouse
es: Hacia un almacén

source: To a warehouse of client
es: Hacia una bodega cliente

source: The provider doesn't have history
es: El proveedor no tiene historial

source: The provider has been disabled
es: El proveedor ha sido deshabilitado

source: The provider has been enabled
es: El proveedor ha sido habilitado

source: The type provider was not found
es: El tipo de proveedor no fue encontrado

source: The sale discount id is incompatible
es: El id del descuento venta es incompatible

source: The minimum amount exceeds the maximum amount
es: La cantidad mínima excede a la cantidad máxima

source: Discounts are not according to quantities
es: Los descuentos no concuerdan con las cantidades

source: The country must be of advance
es: El país debe ser de advance

source: The bussiness name must not be repeated in this country
es: La razon social no debe repetirse en este país

source: The comercial name must not be repeated in this country
es: El nombre comercial no debe repetirse en este país

source: You must send a main contact
es: Debe enviar un contacto principal

source: The company is not related to the product
es: La compañía no está relacionada con el producto

source: You must send at least one company that can bill
es: Debe enviar al menos una compañía que pueda facturar

source: Company is not related with country of the provider
es: La compañía no esta relacionada con el país del proveedor

source: Juridical
es: Jurídico

source: Other
es: Otro

source: Main dispatch address is missing in a country
es: Direcciones principales inválidas de despacho por país

source: Main retire address is missing in a country
es: Direcciones principales inválidas de retiro por país

source: Provider requires main addresses by country
es: Proveedor requiere direcciones principales por país

source: The provider dispatch address was not found
es: La dirección de despacho no fue encontrada

source: The type dispatch was not found
es: El tipo de despacho no fue encontrado

source: The agent address was not found
es: La dirección del agente no fue encontrada

source: The agent address is disabled
es: La dirección del agente enviada está desactivada

source: The address was not found
es: La dirección no fue encontrada

source: The country is not related to the country of the address
es: El país no está relacionado con el país de la dirección

source: There is more than one main address per country
es: No puede haber más de una dirección principal por país

source: The provider must have a main dispatch address
es: El proveedor debería tener al menos una dirección principal de despacho

source: The provider must have a main retire address
es: El proveedor debería tener al menos una dirección principal de retiro

source: The provider cannot make dispatchs
es: El proveedor no puede despachar

source: The quotation has not been found
es: No se encontró la cotización

source: The provider is not enabled
es: El proveedor está desactivado

source: Advance Warranty
es: Garantía Advance

source: Partially converted to OC
es: Convertido parcialmente en OC

source: Converted to OC
es: Convertido en OC

source: Stowage General Inventory
es: Bodega Inventario General

source: Stowage Client Inventory
es: Bodega Inventario Cliente

source: Stowage Internal consumption
es: Bodega Consumo Interno

source: Stowage Advance Warranty
es: Bodega Garantía Advance

source: Canceled
es: Anulado

source: The product isn't related to the provider
es: El producto no está relacionado con el proveedor

source: Products should not be repeated
es: Los productos no deben repetirse

source: Warehouse was not found
es: El almacén no se ha encontrado

source: Warehouse must not be activated
es: El almacén no debe estar activado

source: The warehouse must not have products
es: El almacén no debe tener productos

source: Warehouse must not be disabled
es: El almacén no debe estar desactivado

source: This code already exists
es: El código ingresado ya existe

source: The warehouse has not been found
es: No se ha encontrado el almacén

source: The company does not belong to the country
es: La compañía no pertenece al país

source: The company not exist
es: La compañía no existe

source: Company should not be repeated
es: La compañía no debe repetirse

source: Cannot remove a company because it has products
es: No se puede eliminar una compañía porque tiene productos

source: The field has not been found
es: El campo no ha sido encontrado

source: A warehouse with the same name already exists
es: Ya existe un almacén con el mismo nombre

source: A warehouse with the same code already exists
es: Ya existe un almacén con el mismo código

source: The model related to the field does not exist
es: El modelo relacionado al campo no existe

source: The business name already exists
es: La razón social ya existe

source: The commercial name already exists
es: El nombre comercial ya existe

source: The timezone of issue date is invalid
es: El timezone de la fecha de emisión es inválido
