Repository: Gustavo1011/pcentryx_backend
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: es

source: The start date must be sent
es: La fecha inicial debe ser enviado

source: The end date must be sent
es: la fecha final debe ser enviado

source: The company does not exist
es: La compañia no existe

source: The Type requisition does not exist
es: El tipo de requisición no existe

source: The Requisition state does not exist
es: El estado de requisición no existe

source: The requisition_id was not found
es: El requisition_id no fue encontrado

source: Page must also be 0
es: La página también debe ser 0

source: Limit must also be 0
es: El límite también debe ser 0

source: The client has not been found
es: No se ha encontrado el cliente

source: The product has not been found
es: No se ha encontrado el producto

source: The company has not been found
es: No se ha encontrado la compañia

source: The product company is not enabled
es: La compañia del producto no está habilitada

source: The type product was not found
es: No se encontró el tipo de producto

source: The type communication was not found
es: No se encontró el tipo de comunicación

source: Field not required
es: Campo no requerido

source: The brand has not been found
es: No se ha encontrado la marca

source: This name already exists
es: Este nombre ya existe

source: The provider_quotation_id was not found
es: El provider_quotation_id no fue encontrado

source: The information was obtained successfully
es: La información se obtuvo con éxito

source: This provider is not enabled
es: Este proveedor no esta habilitado

source: This country is not enabled for this provider
es: Este país no esta habilitado para este proveedor

source: The country should be the same as the origin country of provider
es: El país debería ser igual al país de procedencia del proveedor

source: This provider has a history
es: Este proveedor tiene un historial

source: The product_provider_country_id was not found
es: La relación producto proveedor país no fue encontrada

source: This agent has a history
es: Este agente tiene un historial

source: Only one main contact
es: Solo un contacto principal

source: Only should exist a main address for country
es: Solo debería existir una dirección principal por país

source: There is not a main address for country
es: No hay una dirección principal por país

source: Only should exist a main contact
es: Solo debería existir un contacto principal

source: There is not a main contact
es: No hay un contacto principal

source: Required field
es: Campo requerido

source: Unrequired field
es: Campo no requerido

source: Field is not required
es: Campo no requerido

source: Unknown field
es: Campo desconocido

source: Field '{0}' is required
es: El campo '{0}' es requerido

source: Depends on these values: {constraint}
es: Depende de estos valores: {constraint}

source: {0} must not be present with '{field}'
es: {0} no debe estar presente con '{field}'

source: Field should not be empty
es: El campo no debe estar vacío

source: Must be of {constraint} type
es: Debe ser del tipo {constraint}

source: Length of list should be {constraint}, it is {0}
es: La longitud de la lista debe ser {constraint}, es {0}

source: Min length is {constraint}
es: La longitud mínima es {constraint}

source: Max length is {constraint}
es: La longitud máxima es {constraint}

source: Value does not match regex '{constraint}'
es: El valor no coincide con la expresión regular '{constraint}'

source: Min value is {constraint}
es: El valor mínimo es {constraint}

source: Max value is {constraint}
es: El valor máximo es {constraint}

source: Unallowed value {value}
es: Valor no permitido {value}

source: Unallowed values {0}
es: Valores no permitidos {value}

source: Field '{field}' cannot be coerced
es: El campo '{field}' no se puede forzar

source: Field '{field}' cannot be renamed
es: El campo '{field}' no se puede renombrar

source: Field is read-only
es: El campo es de solo lectura

source: Default value for '{field}' cannot be set: {0}
es: El valor por defecto para '{field}' no se puede establecer: {0}

source: Mapping doesn't validate subschema: {0}
es: El mapeo no valida el subesquema: {0}

source: One or more sequence-items don't validate: {0}
es: Uno o más elementos de secuencia no se validan: {0}

source: One or more properties of a mapping don't validate: {0}
es: Una o más propiedades de un mapeo no validan: {0}

source: One or more values in a mapping don't validate: {0}
es: Uno o más valores en un mapeo no validan: {0}

source: One or more definitions validate
es: Una o más definiciones validan

source: None or more than one rule validate
es: Ninguna o más de una regla validan

source: No definitions validate
es: No hay definiciones por validar

source: One or more definitions don't validate
es: Una o más definiciones no validan

source: Invalid value format
es: Formato de valor no válido

source: Invalid request
es: Solicitud inválida

source: Missing username parameter
es: Falta el parámetro de nombre de usuario

source: Missing password parameter
es: Falta el parámetro de contraseña

source: Bad username
es: Nombre de usuario incorrecto

source: Bad password
es: Contraseña incorrecta

source: The username already exists
es: El nombre de usuario ya existe

source: The email already exists
es: El email ya existe

source: The name already exists
es: El nombre ya existe

source: ID must only contain an integer
es: La ID solo debe contener un número entero

source: The record was not found
es: No se encontró el registro

source: The record has been deleted successfully
es: El registro ha sido eliminado con éxito

source: The search has been successful
es: La búsqueda ha sido exitosa

source: Registration has been successful
es: El registro ha sido exitoso

source: The update has been successful
es: La actualización ha sido exitosa

source: The delete has been successful
es: La eliminación ha sido exitosa

source: The manufacturer was not found
es: No se encontró el fabricante

source: The brand was not found
es: No se encontró la marca

source: The product subcategory was not found
es: No se encontró la subcategoría de producto

source: The product category was not found
es: No se encontró la categoría de producto

source: ID should not be repeated
es: La identificación no debe repetirse

source: The document category type was not found
es: No se encontró la categoría del documento

source: The country was not found
es: No se encontró el país

source: The document was not found
es: No se encontró el documento

source: The company was not found
es: No se encontró la compañía

source: The type permission was not found
es: No se encontró el tipo de permiso

source: The permission file was not found
es: No se encontró el archivo de permiso

source: The provider country was not found
es: No se encontró el país de proveedor

source: The product company was not found
es: No se encontró la compañía de producto

source: The minimum amount %(x)s exceeds the maximum amount %(y)s
es: La cantidad mínima %(x)s supera a la cantidad máxima %(y)s

source: The discounts are superimposed
es: Los descuentos se encuentran superpuestos

source: Import
es: Importación

source: Export
es: Exportación

source: Commercialization
es: Comercialización

source: Transport
es: Transporte

source: Storage
es: Almacenaje

source: The product cannot be non-storable by itself
es: El producto no puede ser no almacenable por sí mismo

source: The company ID is repeated in the same form
es: El ID de la compañía se repite en el mismo formulario

source: The permission ID is repeated in the same form
es: El ID del permiso se repite en el mismo formulario

source: The product ID is repeated in the same form
es: El ID del producto se repite en el mismo formulario

source: Internal error. Please contact the administrator.
es: Error interno. Por favor contacte con el administrador.

source: Access token generated successfully
es: Token de acceso generado con éxito

source: The contact does not belong to the provider
es: El contacto no pertenece al proveedor

source: United State Dollar
es: Dólar estadounidense

source: Venezuelan bolívar
es: Bolívar venezolano

source: Credit card
es: Tarjeta de crédito

source: The due date field is required
es: El campo fecha de vencimiento es requerido

source: The due date field must be after the issue date field
es: La fecha de vencimiento debe ser posterior a la fecha de emisión

source: Login not available
es: Inicio de sesión no disponible

source: Pending review
es: Pendiente de revisión

source: Rejected
es: Rechazado

source: Approved
es: Aprobado

source: Order
es: Pedido

source: General Inventory
es: Inventario General

source: Client Inventory
es: Inventario Cliente

source: Internal consumption
es: Consumo interno

source: General Inventory Stowage
es: Bodega inventario general

source: Client Inventory Stowage
es: Bodega inventario cliente

source: Stowage of orders
es: Bodega de pedidos

source: Partial
es: Parcial

source: Complete
es: Completa

source: The manufacturer code already exists
es: El código de fabricante ya existe

source: No relationship was found between permission and its type
es: No se encontró relación entre permiso y su tipo

source: The product file was not found
es: No se encontró el archivo de producto

source: Consolidator
es: Consolidador

source: Logistic
es: Logístico

source: Customs
es: Aduanal

source: Intermediary
es: Intermediario

source: Countries are required
es: Los países son requeridos

source: The currency was not found
es: No se encontró la moneda

source: The provider was not found
es: No se encontró el proveedor

source: The provider is not related to the country
es: El proveedor no tiene relación con el país

source: The payment number already exists
es: El número de pago ya existe

source: The product was not found
es: No se encontró el producto

source: The tax identification number is required
es: El número de identificación fiscal es requerido

source: The tax identification number already exists
es: El número de identificación fiscal ya existe

source: Product code should not be repeated
es: El código del producto no debe repetirse

source: This field is required
es: Este campo es requerido

source: The end date field must be after the start date field
es: La fecha de fin debe ser posterior a la fecha de inicio

source: National
es: Nacional

source: International
es: Internacional

source: Created
es: Creado

source: Sent
es: Enviado

source: Confirmed by provider
es: Confirmado por proveedor

source: Urgent
es: Urgente

source: Maritime
es: Marítimo

source: Air
es: Aéreo

source: Ground
es: Terrestre

source: The company is not related to the country
es: La compañía no tiene relación con el país

source: The product category is not related to the analyst
es: La categoría del producto no está relacionada con el analista

source: The relationship has been successfully removed
es: La relación ha sido removida satisfactoriamente

source: The list should at least one element
es: La lista debe tener al menos un elemento

source: It cannot be edited because the request is related to a purchase order
es: No se puede editar debido a que la solicitud está relacionada con una orden de compra

source: The purchase was not found
es: No se encontró la orden de compra

source: The purchase priority was not found
es: No se encontró la orden de prioridad de compra

source: The type purchase priority was not found
es: No se encontró el tipo de compra

source: The purchase dispatch priority was not found
es: No se encontró el despacho de compra

source: The purchase can only be edited at the stage Sent
es: La OC solo se puede editar en la etapa Enviado

source: The delivery date field must be after than or equal to the current date
es: La fecha de entrega debe ser posterior o igual a la fecha actual

source: The purchase status must be sent
es: El estado de compra debe ser enviado

source: The purchase state must be confirmed by provider
es: El estado de la orden de compra debe ser confirmado por el proveedor

source: Purchase receipt
es: Recepción de compra

source: The agent must be consolidator
es: El agente debe ser consolidador

source: The purchase product was not found
es: No se encontró la compra de producto

source: The id field is required
es: El campo id es requerido

source: The requisition product is not related to the purchase
es: La requisición del producto no esta relacionada con la compra

source: There must be at least one related purchase product
es: Debería haber más de una compra de producto relacionada

source: The purchase product to delete was not found
es: La compra de producto a eliminar no ha sido encontrada

source: Amount must not be greater than the available quantity
es: La cantidad no debe ser mas grande que la cantidad disponible

source: Number must be correlative
es: Los números deben ser correlativos

source: Direct delivery
es: Envío directo

source: The amount must not exceed what is required
es: La cantidad no debe exceder lo requerido

source: Consumable
es: Consumible

source: Equipment
es: Equipo

source: Continuous
es: Continuo

source: Colon
es: Colón

source: Swiss franc
es: Franco suizo

source: The quotation date must be before or equal to the current date
es: La fecha de cotización debe ser anterior o igual a la fecha actual

source: Provider does not have the dispatch active
es: El proveedor no tiene despacho activo

source: You must send only one main address
es: Debe enviar una sola dirección como principal

source: At least one of agent or warehouse must be sent
es: Al menos un agente o warehouse debe ser enviado

source: Provider address was not found
es: La dirección de proveedor no ha sido encontrada

source: The agent was not found
es: No ha sido encontrado el agente

source: The warehouse was not found
es: No ha sido encontrado el almacén

source: You must send at least one provider contact
es: Debe enviar al menos un contacto de proveedor

source: You must send only one main contact
es: Debe enviar solo un contacto principal

source: There should only be one main contact
es: Solo debe haber un contacto principal

source: Id must be sent
es: ID debe ser enviado

source: The provider must be international
es: El proveedor debe ser de tipo internacional

source: Verification completed successfully
es: Verificación completada con éxito

source: The provider is national in type and no country is required
es: El proveedor es de tipo nacional y no se requiere país

source: The country is not enabled by the provider
es: El país no está habilitado por el proveedor

source: The provider quotation product was not found
es: No se encontró la cotización de producto y proveedor

source: Detailed merchandise
es: Mercancía detallada

source: Not detailed merchandise
es: Mercancía no detallada

source: Pre-shipment
es: Pre-embarque

source: Shipment
es: Embarque

source: Sent by provider
es: Enviado por proveedor

source: Retired by advance
es: Retirado por advance

source: Nationalization
es: Nacionalización

source: The purchase order must not be in transport or shipment
es: La orden de compra no debe estar en transporte o embarque

source: Transport agent must be of agent type Transport
es: Agente de transporte debe ser un agente de tipo Transporte

source: Destination agent must be of agent type Consolidator
es: El agente de destino debe ser del tipo Consolidador

source: Agent should be a consolidator type
es: Agente debería ser de tipo Consolidador

source: Tracking Number is already sent
es: El tracking number ya se encuentra enviado

source: The provider must be able to dispatch
es: El proveedor debe poder despachar

source: The dispatch country must be the same as the provider's country of origin
es: El país de despacho debe ser igual al país de procedencia del proveedor

source: The billing country must be the same as the provider's country of origin
es: El país de facturación debe ser igual al país de procedencia del proveedor

source: The billing company must belong to the billing country
es: La compañía de facturación debe pertenecer al país de facturación

source: The billing country must be a country enabled for the provider
es: La país de facturación debe ser un país habilitado para el proveedor

source: The dispatch country must be the same as the provider's country of address
es: El país de despacho debe ser igual al país de la dirección del proveedor

source: The provider address was not found
es: No se encontró la dirección del proveedor

source: The billing company was not found
es: No se encontró la compañía de facturación

source: The billing country was not found
es: No se encontró el país de facturación

source: The purchase shipping type was not found
es: No se encontró el tipo de envío de compra

source: The dispatch country was not found
es: No se encontró el país de despacho

source: The purchase status must be created
es: El estado de compra debe ser creado

source: The date required field must be after than or equal to the current date
es: La fecha requerida debe ser mayor o igual a la fecha actual

source: The provider must be national
es: El proveedor debe ser nacional

source: New requisition with code {}
es: Nueva requisición con código {}

source: New requisition product with code {}
es: Nuevo producto en requisición con código {}

source: Requisition Product deleted with code {}
es: Producto de requisición borrado con código {}

source: Requisition Product modified with code {}
es: Producto de requisición modificado con código {}

source: Requisition with code {} was no longer approved
es: Requisición con código {} dejó de ser aprobada

source: There is no stock available in the product with code {}
es: No hay stock disponible en el producto con código {}

source: Requisition approved with code {}
es: Requisición aprobada con código {}

source: There should be two or more purchase warehouse
es: Debe haber dos o más almacenes de compra

source: Purchase move has already been received
es: El traslado de compra ha sido recibido

source: The date must be current or a day before
es: La fecha debe ser actual o de un día anterior

source: TThe package product was not found
es: No se encontró el producto del paquete

source: Purchase product id must not be repeated
es: El producto de compra no debe repetirse

source: The purchase order must have at least one enabled product
es: La orden de compra debe tener al menos un producto habilitado

source: You must enter at least one of the amount or deleted fields
es: Debes ingresar al menos uno de los campos monto o eliminado

source: The tracking number was not found
es: No se encontró el número de seguimiento

source: The number of packages must be equal to 1
es: El número de paquetes debe ser igual a 1

source: The number of packages must be equal to one
es: El número de paquetes debe ser igual a uno

source: Packages must have the same purchase order
es: Los paquetes deben tener el mismo orden de compra

source: The purchase order of the packages must be international
es: El tipo de orden de compra de los paquetes deben ser internacional

source: The purchase order of the packages must be confirmed by provider
es: La orden de compra de los paquetes debe estar confirmada por el proveedor

source: Packages must be fully numbered
es: Los paquetes deben estar completamente enumerados

source: The quantity of products available must be more than required
es: La cantidad de productos disponibles debe ser mayor al de los requeridos

source: The tracking number has already been registered
es: El tracking number ya ha sido registrado

source: The purchase order must be international
es: La orden de compra debe ser de tipo internacional

source: The purchase state must be Confirmed by provider
es: El estado de la orden de compra debe estar confirmada por el proveedor

source: The warehouse manager was not found
es: No fue encontrado el jefe de almacén

source: The company is not in the same country
es: La compañía no se ubica en el mismo país

source: The companies field must be have at least one id
es: Debe haber al menos un id en el campo de compañías

source: The staffs field must be have at least one id
es: Debe haber al menos un id en el campo staffs

source: A product can only be associated with a proveedor
es: Un producto solo puede asociarse con un proveedor

source: The product country was not found
es: No se encontró el país del producto

source: The product type permission was not found
es: No se encontró el tipo de permiso del producto

source: The product permission was not found
es: No se encontró el permiso del producto

source: Tax cannot be greater than 0 if its exempted of IVA
es: El impuesto no puede ser mayor que 0 si está exento de IVA

source: The maximum temperature must be greater than or equal to the minimum temperature
es: La temperatura máxima debe ser mayor o igual que la temperatura mínima

source: You must send at least one field
es: Se debe enviar al menos un campo

source: You must send at least two ids
es: Debe enviar al menos dos ids

source: The purchase warehouse agent must be a consolidator type
es: El agente de purchase warehouse debe ser de tipo consolidador

source: Purchases warehouses has different agents
es: Los purchase warehouses tienen diferentes agentes

source: The purchase not enabled for this API
es: La orden de compra no está habilitada para esta API

source: The product was not found or is not related to the purchase order
es: El producto no fue encontrado o no está relacionado a la orden de compra

source: You must enter at least one of the amount, unit cost or deleted fields
es: Debe ingresar al menos uno de los campos monto, costo unitario o campo eliminado

source: The product must have at least a file enabled
es: El producto debe tener al menos un archivo habilitado

source: The provider contact was not found
es: No se encontró el contacto de proveedor

source: Cannot edit provider contact when creating a provider
es: No se puede editar un contacto cuando se está creando un proveedor

source: This field should not be sent
es: Este campo no debe enviarse

source: Type_permissions field is required
es: El campo tipo de permisos es requerido

source: The product subcategory must have values in all companies
es: La subcategoría de producto debe tener valores en todas las compañías

source: Administrator
es: Administrador

source: Warehouse manager
es: Jefe de almacén

source: Storer
es: Almacenista

source: Seller
es: Vendedor

source: Purchaser
es: Comprador

source: Category leader
es: Líder de categorías

source: Sales leader
es: Líder de ventas

source: Category analyst
es: Analista de categorías

source: Technical manager
es: Gerente técnico

source: The code already exists
es: El código ya existe

source: The user was not found
es: No se ha encontrado el usuario

source: The user must be of type warehouse manager
es: El usuario debe ser de tipo Jefe de almacén

source: The user must be of type storer
es: El usuario debe ser de tipo almacenista

source: License
es: Licencia

source: Permission
es: Permiso

source: Cannot be removed because there are dependencies
es: No se puede eliminar debido a que existen dependencias

source: The name already exists in that country
es: El nombre ya existe en ese país

source: The code already exists in that country
es: El código ya existe en ese país

source: The type document authorization was not found
es: No se ha encontrado el tipo de autorización de documento

source: The type document category was not found
es: No se ha encontrado la categoría de documento

source: The issue date must be before or equal to the due date
es: La fecha de emisión debe ser anterior a la fecha de vencimiento

source: Dates must not be within the range of the active document
es: La fechas no deben estar dentro del rango del documento activo
